/*
░█ 
░░░░░██╗░█████╗░███████╗██╗░░░░░
░░░░░██║██╔══██╗██╔════╝██║░░░░░
░░░░░██║██║░░██║█████╗░░██║░░░░░
██╗░░██║██║░░██║██╔══╝░░██║░░░░░
╚█████╔╝╚█████╔╝███████╗███████╗
░╚════╝░░╚════╝░╚══════╝╚══════╝

███╗░░░███╗██████╗░
████╗░████║██╔══██╗
██╔████╔██║██║░░██║
██║╚██╔╝██║██║░░██║
██║░╚═╝░██║██████╔╝
╚═╝░░░░░╚═╝╚═════╝░
WHATSAPP BOT BY @joel james tech
Helpers - @joel james
        - @joel it
WHATSAPP - 255714595078
SUPPORT GROUP - https://wa.me/255714595078
Don't change this info else bot won't work by joeljames tech

*/


















const _0x3a0217=_0x49e5;(function(_0x7513f7,_0x1a271e){const _0x24ecdc=_0x49e5,_0x2d05d6=_0x7513f7();while(!![]){try{const _0xce61cf=-parseInt(_0x24ecdc(0xde))/0x1+parseInt(_0x24ecdc(0xdc))/0x2*(-parseInt(_0x24ecdc(0xe7))/0x3)+parseInt(_0x24ecdc(0xeb))/0x4*(-parseInt(_0x24ecdc(0xd7))/0x5)+-parseInt(_0x24ecdc(0xca))/0x6*(-parseInt(_0x24ecdc(0xc4))/0x7)+parseInt(_0x24ecdc(0xcb))/0x8*(-parseInt(_0x24ecdc(0xe3))/0x9)+parseInt(_0x24ecdc(0xe6))/0xa+parseInt(_0x24ecdc(0xd6))/0xb;if(_0xce61cf===_0x1a271e)break;else _0x2d05d6['push'](_0x2d05d6['shift']());}catch(_0x22d2c8){_0x2d05d6['push'](_0x2d05d6['shift']());}}}(_0x4680,0xbe70b));const util=require('util'),fs=require('fs-extra'),{zokou}=require(__dirname+_0x3a0217(0xea)),{format}=require(__dirname+_0x3a0217(0xdb)),os=require('os'),moment=require(_0x3a0217(0xd2)),s=require(__dirname+_0x3a0217(0xc3)),more=String['fromCharCode'](0x200e),Taphere=more[_0x3a0217(0xcd)](0xfa1);function _0x4680(){const _0x202fc8=['public','DD/MM/YYYY','\x0a𝚛𝚊𝚖\x20:\x20𝟸𝟷/𝟼𝟷.𝟿\x20𝙶𝙱\x0a𝚙𝚕𝚊𝚝𝚏𝚘𝚛𝚖\x20:\x20𝚌𝚑𝚛𝚘𝚖𝚎(𝚕𝚞𝚗𝚒𝚡)\x20\x0a𝚜𝚝𝚊𝚝𝚞𝚜\x20:\x20𝚋𝚘𝚝\x20𝚒𝚜\x20𝚘𝚗𝚕𝚒𝚗𝚎\x0a𝚙𝚕𝚞𝚐𝚒𝚗\x20:\x20\x20','moment-timezone','menu','format','match','32895654dajjGj','3446095BHAxgh','log','\x0a𝚝𝚑𝚎𝚖𝚎\x20:\x20𝚓𝚘𝚎𝚕\x20𝚝𝚎𝚌𝚑\x0a𝚕𝚒𝚋𝚛𝚊𝚛𝚢\x20:\x20𝚋𝚊𝚒𝚕𝚠𝚊𝚢𝚜\x0a𝚙𝚘𝚗𝚐\x20:\x20𝟾𝟸𝟶\x20𝚖/𝚜\x20','sendMessage','/../framework/mesfonctions','2MRfYtZ','length','842021IbIhVy','toLocaleLowerCase','categorie','Je\x20suis\x20*Beltahmd*,\x20déveloper\x20Beltah\x20Tech','nomCom','9nWRZGq','private','🥵🥵\x20Menu\x20erreur\x20','3093410eDSYge','1479981MzThCC','pushName','map','/../framework/zokou','4tffEKo','\x20\x0a𝚑𝚘𝚠\x20𝚊𝚛𝚎\x20𝚢𝚘𝚞\x20𝚒𝚜\x20𝚖𝚢\x20𝚑𝚘𝚙𝚎\x20𝚢𝚘𝚞\x20𝚊𝚛𝚎\x20doing\x20𝚐𝚘𝚘𝚍\x0a𝚠𝚎𝚕𝚌𝚘𝚖𝚎\x20𝚝𝚘\x20𝚓𝚘𝚎𝚕\x20𝚖𝚞𝚕𝚝𝚒𝚍𝚎𝚟𝚒𝚌𝚎\x20𝚋𝚘𝚝\x0a\x0a*𝚑𝚎𝚛𝚎\x20𝚊𝚛𝚎\x20𝚖𝚢\x20𝚘𝚠𝚗𝚎𝚛\x20𝚒𝚗𝚏𝚘𝚛𝚖𝚊𝚝𝚒𝚘𝚗*\x0a𝚋𝚘𝚝\x20𝚗𝚊𝚖𝚎\x20:\x20𝚓𝚘𝚎𝚕\x20𝚖𝚍\x20𝚠𝚊\x20𝚋𝚘𝚝\x0a𝚟𝚒𝚜𝚒𝚘𝚗\x20:\x20𝟹.𝟻.𝟶
