/*
░█ 
░░░░░██╗░█████╗░███████╗██╗░░░░░
░░░░░██║██╔══██╗██╔════╝██║░░░░░
░░░░░██║██║░░██║█████╗░░██║░░░░░
██╗░░██║██║░░██║██╔══╝░░██║░░░░░
╚█████╔╝╚█████╔╝███████╗███████╗
░╚════╝░░╚════╝░╚══════╝╚══════╝

███╗░░░███╗██████╗░
████╗░████║██╔══██╗
██╔████╔██║██║░░██║
██║╚██╔╝██║██║░░██║
██║░╚═╝░██║██████╔╝
╚═╝░░░░░╚═╝╚═════╝░

██████╗░░█████╗░████████╗
██╔══██╗██╔══██╗╚══██╔══╝
██████╦╝██║░░██║░░░██║░░░
██╔══██╗██║░░██║░░░██║░░░
██████╦╝╚█████╔╝░░░██║░░░
╚═════╝░░╚════╝░░░░╚═╝░░░
WHATSAPP BOT BY @joel james tech
Helpers - @joel james
        - @joel it
WHATSAPP - 255714595078
SUPPORT GROUP - https://wa.me/255714595078
Don't change this info else bot won't work by joeljames tech

*/










const _0x7dcaa4=_0x32b0;(function(_0x1eaf82,_0xb2db7e){const _0x28d1a5=_0x32b0,_0x2e9440=_0x1eaf82();while(!![]){try{const _0x10a2f6=parseInt(_0x28d1a5(0x14c))/0x1*(parseInt(_0x28d1a5(0x145))/0x2)+parseInt(_0x28d1a5(0x140))/0x3+parseInt(_0x28d1a5(0x13e))/0x4+parseInt(_0x28d1a5(0x13d))/0x5*(parseInt(_0x28d1a5(0x13f))/0x6)+parseInt(_0x28d1a5(0x134))/0x7+-parseInt(_0x28d1a5(0x13b))/0x8+-parseInt(_0x28d1a5(0x14d))/0x9;if(_0x10a2f6===_0xb2db7e)break;else _0x2e9440['push'](_0x2e9440['shift']());}catch(_0x58313e){_0x2e9440['push'](_0x2e9440['shift']());}}}(_0x2000,0xba04a));function _0x2000(){const _0xfbfc06=['\x0a*𝙹𝙾𝙴𝙻\x20𝙼𝙳\x20𝙼𝙳\x20\x20𝙲𝙿𝚄*\x0a*𝙹𝙾𝙴𝙻\x20𝙼𝙳\x20𝙾𝚆𝙽𝙴𝚁*\x20:\x20','/../framework//zokou','MODE_PUBLIC','oui','\x20*𝙹𝙾𝙴𝙻\x20𝙼𝙳\x20𝙲𝙿𝚄\x20𝙼𝙴𝙽𝚄*\x0a\x0a','push','asia/karachi\x20','/../framework/zokou','public','deploy','format','util','cpu','\x0a*𝚁𝚎𝚜𝚙𝚘𝚗𝚍\x20𝚜𝚙𝚎𝚎𝚍\x20:\x20𝟷𝟶𝟾𝚖𝚜*\x0a*𝙲𝚁𝙴𝙰𝚃𝙾𝚁*\x20:\x20𝙹𝙾𝚎𝚕\x20𝚝𝚎𝚌𝚑\x0a\x0a>\x20keep\x20using\x20joel\x20md\x0a\x0a','3910802YaSkTF','date','🥵🥵\x20Menu\x20erreur\x20','DD/MM/YYYY','HH:MM:SS','map','https://telegra.ph/file/517b32aafd990bc642ec3.jpg','9239440NSKhKs','sendMessage','20aIqMOc','4090576QGAwXB','787830WTyDco','833010aJDAAd','moment-timezone','pushName','log','OWNER_NAME','44yrDvHw','private','©TKM\x20INC','\x0a*𝚈𝙾𝚄𝚁\x20𝙽𝙰𝙼𝙴*\x20:\x20','/../set','categorie','\x0a*𝚃𝙾𝚃𝙰𝙻\x20𝙹𝙾𝙴𝙻\x20𝙼𝙳\x20𝚄𝚂𝙴𝚁𝚂\x20:\x20𝟷𝟶𝟾𝟿+𝚄𝚜𝚎𝚛𝚜*\x0a*𝚁𝙰𝙼*\x20\x20:\x20𝟸𝟷.𝟹/𝟼𝟷.𝟾𝙶𝙱*\x0a*𝚃𝙾𝙾𝙻𝚂*\x20:\x20','5881bIUlrj','5370678JVOahJ','\x0a𝙷𝚎𝚕𝚕𝚘𝚠\x20:\x20'];_0x2000=function(){return _0xfbfc06;};return _0x2000();}function _0x32b0(_0x5ceeed,_0x59db28){const _0x200040=_0x2000();return _0x32b0=function(_0x32b045,_0x5ef4c1){_0x32b045=_0x32b045-0x12c;let _0x552e83=_0x200040[_0x32b045];return _0x552e83;},_0x32b0(_0x5ceeed,_0x59db28);}const util=require(_0x7dcaa4(0x131)),fs=require('fs-extra'),{zokou}=require(__dirname+_0x7dcaa4(0x12d)),{format,styletext}=require(__dirname+'/../framework/mesfonctions'),os=require('os'),moment=require(_0x7dcaa4(0x141)),s=require(__dirname+_0x7dcaa4(0x149));zokou({'nomCom':_0x7dcaa4(0x132),'categorie':_0x7dcaa4(0x12f)},async(_0x31cbf4,_0xeef1e7,_0xd921b2)=>{const _0x5946b0=_0x7dcaa4;let {ms:_0x58a25b,repondre:_0x189431}=_0xd921b2,{cm:_0x4b1195}=require(__dirname+_0x5946b0(0x150));var _0x46ff06={},_0x2362a4=_0x5946b0(0x12e);s[_0x5946b0(0x151)]!=_0x5946b0(0x152)&&(_0x2362a4=_0x5946b0(0x146));var _0x5aa531={'Général':'','Logo':'','hentai':'','weeb':'','Recherche':'','conversion':'','groupe':'','Téléchargement':''};_0x4b1195[_0x5946b0(0x139)](async(_0x4e384d,_0x2a1055)=>{const _0x33ed60=_0x5946b0;if(!_0x46ff06[_0x4e384d[_0x33ed60(0x14a)]])_0x46ff06[_0x4e384d[_0x33ed60(0x14a)]]=[];_0x46ff06[_0x4e384d[_0x33ed60(0x14a)]][_0x33ed60(0x154)](_0x4e384d['nomCom']);});const _0x1d382b=moment(moment())[_0x5946b0(0x130)](_0x5946b0(0x138));moment['tz']['setDefault'](_0x5946b0(0x12c))['locale']('id');const _0x28836e=moment['tz']('asia/karachi')[_0x5946b0(0x130)](_0x5946b0(0x137));console[_0x5946b0(0x143)](_0x5946b0(0x135)+_0x28836e),console[_0x5946b0(0x143)]('temps\x20'+_0x1d382b);let _0x41a790=_0x5946b0(0x153);_0x41a790+=_0x5946b0(0x14e)+_0x58a25b[_0x5946b0(0x142)]+_0x5946b0(0x14f)+s[_0x5946b0(0x144)]+_0x5946b0(0x148)+_0x58a25b[_0x5946b0(0x142)]+_0x5946b0(0x14b)+_0x4b1195['length']+_0x5946b0(0x133);for(const _0x4cbf2c in _0x46ff06){!_0x5aa531[_0x4cbf2c]&&(_0x5aa531[_0x4cbf2c]='');_0x41a790+='';for(const _0x76598b of _0x46ff06[_0x4cbf2c]){_0x41a790+='';}}var _0x30c050=_0x5946b0(0x13a);try{_0xeef1e7[_0x5946b0(0x13c)](_0x31cbf4,{'image':{'url':_0x30c050},'caption':_0x41a790,'footer':_0x5946b0(0x147)},{'quoted':_0x58a25b});}catch(_0xd97b61){console['log']('🥵🥵\x20Menu\x20erreur\x20'+_0xd97b61),_0x189431(_0x5946b0(0x136)+_0xd97b61);}});
